#!/usr/bin/env python
# -*- encoding: utf-8 -*-
'''
@文件    :03.py
@说明    :键盘输入两个整数来实现对两个整数的算术运算。
@时间    :2020/08/24 14:34:01
@作者    :江伟
@版本    :1.0
'''
# 使用input()函数获取键盘输入(字符串)
# 使用int()函数将输入的字符串转换成整数
# 使用print()函数输出带占位符的字符串

a = int(input('a = '))
b = int(input('b = '))

print('%d + %d =%d' %(a , b , a + b))
print('%d - %d =%d' %(a , b , a - b))
print('%d * %d =%d' %(a , b , a * b))
print('%d / %d =%f' %(a , b , a / b))
print('%d // %d =%f' %(a , b , a // b))
print('%d %% %d =%f' %(a , b , a % b))
print('%d ** %d =%f' %(a , b , a ** b))

# console
# a = 100
# b = 2
# 100 + 2 =102
# 100 - 2 =98
# 100 * 2 =200
# 100 / 2 =50.000000
# 100 // 2 =50.000000
# 100 % 2 =0.000000
# 100 ** 2 =10000.000000







