#!/usr/bin/env python
# -*- encoding: utf-8 -*-
'''
@文件    :01.py
@说明    : 构造程序逻辑
1.巩固之前所学
2.利用程序去解决实际问题
@时间    :2020/08/27 09:21:42
@作者    :江伟
@版本    :1.0
'''

"""寻找水仙花数：
说明：水仙花数也被称为超完全数字不变数、自恋数、自幂数、阿姆斯特朗数，
它是一个3位数，该数字每个位上数字的立方之和正好等于它本身，例如：$1^3 + 5^3+ 3^3=153$。
"""

num = int(input("请输入三位正整数："))

if(num > 99 and num < 1000):
    a = num // 100
    temp = num % 100
    b = temp // 10
    c = temp % 10
    if((a**3 + b**3 + c**3) == num):
        print("$%d^3 + %d^3 + %d^3 =%d$，所以它是水仙花数！" % (a, b, c, num))
    else:
        print("%d不是水仙花数!" % num)
else:
    print("输入数字有误！")
