#!/usr/bin/env python
# -*- encoding: utf-8 -*-
'''
@文件    :p06.py
@时间    :2020/09/04 16:48:46
@作者    :江伟
@版本    :1.0
@说明    :
下面的代码演示了如何向列表中添加元素以及如何从列表中移除元素。
'''
list = [1,3,5,7,100]
#添加元素
list.append(200)#尾部追加
print(list)#[1, 3, 5, 7, 100, 200]
list.insert(1,400)#下标为1的位置插入400
print(list)#[1, 400, 3, 5, 7, 100, 200]

#合并两个列表
list += [1000,2000]
print(list)#[1, 400, 3, 5, 7, 100, 200, 1000, 2000]
list.extend([40,50])
print(list)#[1, 400, 3, 5, 7, 100, 200, 1000, 2000, 40, 50]
# 先通过成员运算判断元素是否在列表中，如果存在就删除该元素
if 3 in list:
    list.remove(3)
print(list)#[1, 400, 5, 7, 100, 200, 1000, 2000, 40, 50]

# 从指定的位置删除元素
list.pop(0)
print(list)#[400, 5, 7, 100, 200, 1000, 2000, 40, 50]
list.pop(len(list)-1)
print(list)#[400, 5, 7, 100, 200, 1000, 2000, 40]
list.pop(-1)
print(list)#[400, 5, 7, 100, 200, 1000, 2000]

# 清空列表元素
list.clear()
print(list)#[]

